public class Main {
    public static void main(String[] args) {
        final Bank bank = new Bank();
        Thread1 thread1 = new Thread1(bank);
        Thread2 thread2 = new Thread2(bank);

        thread1.start();
        thread2.start();
    }
}

        /*

            1.1 - Методи inc(), dec() unsynchronized:
                Два потоки Thread1 і Thread2 працють відокремлено один від одного. Вони, не погоджуючи дії один з одним,
                відпрацьовують логіку функцій inc(), dec(). Це фактично створює проблему, адже потоки не знають про
                існування один одного, і просто в циклі встигають змінювати значення змінної за той час, який їм виділив
                планувальник потоків. В результаті в консолі побачили, що змінна "хаотично" інкрементується та
                дикриментується. Всі отримані результати в цьому випадку не є очікуваними.

                Output:
                    inc: 2
                    inc: 4
                    inc: 6
                    dec: 2
                    dec: 7
                    dec: 6
                    dec: 5
                    dec: 4
                    ...


            1.2 - Методи inc(), dec() synchronized:
            Два потоки Thread1 і Thread2 працюють синхронізовано. Це забезпечило такий механізм, щоб доступ до логіки
            функції, що визивається в run() через об'єкт в певний часу був тільки у потока Thread1.
            Поток Thread2 не матиме доступу до тих пір, поки Thread1 не звільнить ресурс. В результаті в консолі
            побачили, що цикл в методі inc() відпрацював повністю,а лише потім - в dec(). Отриманий результат
            є очікуваним.

            Output:
                inc: 2
                inc: 4
                inc: 6
                inc: 8
                ...
                dec: 20000
                dec: 19999
                dec: 19998
                dec: 19997
                ...


            2.1 - Метод run() з логікою анологічну методам inc(), dec() без блоку synchronized(bank)
            Тут також потоки не синхронізовані, просто логіка функцій inc() і dec() перенесена в перевизначену функцію
            run(), що запускає потік.


            2.2 - Метод run() з логікою анологічну методам inc(), dec() з блоком synchronized(bank)
            Інший спосіб синхронізації. В 1.2 синхронізація реалізовувалась з допомогою методу, в цьому ж випадку -
            блоку коду, де синхронізація відбувається по об'єкту класу Bank. Доступ до логіки такого блоку можливий,
            якщо об'єкт bank не захвачений потоком.

        */